# SetStructuralAsset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PropertySetElement..::..SetStructuralAsset Method
PropertySetElement Class See Also
---
Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetStructuralAsset(
	StructuralAsset structuralAsset
)
```

Visual Basic
---
```text
Public Sub SetStructuralAsset ( _
	structuralAsset As StructuralAsset _
)
```

Visual C++
---
```text
public:
void SetStructuralAsset(
	StructuralAsset^ structuralAsset
)
```

# ### Parameters
structuralAsset
    Type: Autodesk.Revit.DB..::..StructuralAsset
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the name of the asset is empty, contains prohibited characters, or is not unique |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PropertySetElement Class
Autodesk.Revit.DB Namespace